MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA306/mcu.h
extern volatile PMCS1CFBITS PMCS1CFbits __attribute__((__sfr__));

#define PMCS1BS PMCS1BS
extern volatile uint16_t PMCS1BS __attribute__((__sfr__));
typedef struct tagPMCS1BSBITS {
  uint16_t :3;
  uint16_t BASE11:1;
  uint16_t :3;
  uint16_t BASE15:1;
  uint16_t BASE16:1;
  uint16_t BASE17:1;
  uint16_t BASE18:1;
  uint16_t BASE19:1;
  uint16_t BASE20:1;
  uint16_t BASE21:1;
  uint16_t BASE22:1;
  uint16_t BASE23:1;
} PMCS1BSBITS;
extern volatile PMCS1BSBITS PMCS1BSbits __attribute__((__sfr__));

#define PMCS1MD PMCS1MD
extern volatile uint16_t PMCS1MD __attribute__((__sfr__));
__extension__ typedef struct tagPMCS1MDBITS {
  union {
    struct {
      uint16_t DWAITE:2;
      uint16_t DWAITM:4;
      uint16_t DWAITB:2;
      uint16_t :3;
      uint16_t AMWAIT:3;
      uint16_t ACKM:2;
    };
    struct {
      uint16_t DWAITE0:1;
      uint16_t DWAITE1:1;
      uint16_t DWAITM0:1;
      uint16_t DWAITM1:1;
      uint16_t DWAITM2:1;
      uint16_t DWAITM3:1;
      uint16_t DWAITB0:1;
      uint16_t DWAITB1:1;
      uint16_t :3;
      uint16_t AMWAIT0:1;
      uint16_t AMWAIT1:1;
      uint16_t AMWAIT2:1;
      uint16_t ACKM0:1;
      uint16_t ACKM1:1;
    };
  };
} PMCS1MDBITS;
extern volatile PMCS1MDBITS PMCS1MDbits __attribute__((__sfr__));

#define PMCS2CF PMCS2CF
extern volatile uint16_t PMCS2CF __attribute__((__sfr__));
__extension__ typedef struct tagPMCS2CFBITS {
  union {
    struct {
      uint16_t :5;
      uint16_t PTSZ:2;
      uint16_t ACKP:1;
      uint16_t SM:1;
      uint16_t RDSP:1;
      uint16_t WRSP:1;
      uint16_t :1;
      uint16_t BEP:1;
      uint16_t CSPTEN:1;
      uint16_t CSP:1;
      uint16_t CSDIS:1;
    };
    struct {
      uint16_t :5;
      uint16_t PTSZ0:1;
      uint16_t PTSZ1:1;
    };
  };
} PMCS2CFBITS;
extern volatile PMCS2CFBITS PMCS2CFbits __attribute__((__sfr__));

#define PMCS2BS PMCS2BS
extern volatile uint16_t PMCS2BS __attribute__((__sfr__));
typedef struct tagPMCS2BSBITS {
  uint16_t :3;
  uint16_t BASE11:1;
  uint16_t :3;
  uint16_t BASE15:1;
  uint16_t BASE16:1;
  uint16_t BASE17:1;
  uint16_t BASE18:1;
  uint16_t BASE19:1;
  uint16_t BASE20:1;
  uint16_t BASE21:1;
  uint16_t BASE22:1;
  uint16_t BASE23:1;
} PMCS2BSBITS;
extern volatile PMCS2BSBITS PMCS2BSbits __attribute__((__sfr__));

#define PMCS2MD PMCS2MD
extern volatile uint16_t PMCS2MD __attribute__((__sfr__));
__extension__ typedef struct tagPMCS2MDBITS {
  union {
    struct {
      uint16_t DWAITE:2;
      uint16_t DWAITM:4;
      uint16_t DWAITB:2;
      uint16_t :3;
      uint16_t AMWAIT:3;
      uint16_t ACKM:2;
    };
    struct {
      uint16_t DWAITE0:1;
      uint16_t DWAITE1:1;
      uint16_t DWAITM0:1;
      uint16_t DWAITM1:1;
      uint16_t DWAITM2:1;
      uint16_t DWAITM3:1;
      uint16_t DWAITB0:1;
      uint16_t DWAITB1:1;
      uint16_t :3;
      uint16_t AMWAIT0:1;
      uint16_t AMWAIT1:1;
      uint16_t AMWAIT2:1;
      uint16_t ACKM0:1;
      uint16_t ACKM1:1;
    };
  };
} PMCS2MDBITS;
extern volatile PMCS2MDBITS PMCS2MDbits __attribute__((__sfr__));

#define PMDOUT1 PMDOUT1
extern volatile uint16_t PMDOUT1 __attribute__((__sfr__));
#define PMDOUT2 PMDOUT2
extern volatile uint16_t PMDOUT2 __attribute__((__sfr__));
#define PMDIN1 PMDIN1
extern volatile uint16_t PMDIN1 __attribute__((__sfr__));
#define PMDIN2 PMDIN2
extern volatile uint16_t PMDIN2 __attribute__((__sfr__));
#define PMSTAT PMSTAT
extern volatile uint16_t PMSTAT __attribute__((__sfr__));
typedef struct tagPMSTATBITS {
  uint16_t OB0E:1;
  uint16_t OB1E:1;
  uint16_t OB2E:1;
  uint16_t OB3E:1;
  uint16_t :2;
  uint16_t OBUF:1;
  uint16_t OBE:1;
  uint16_t IB0F:1;
  uint16_t IB1F:1;
  uint16_t IB2F:1;
  uint16_t IB3F:1;
  uint16_t :2;
  uint16_t IBOV:1;
  uint16_t IBF:1;
} PMSTATBITS;
extern volatile PMSTATBITS PMSTATbits __attribute__((__sfr__));

#define ALRMVAL ALRMVAL
extern volatile uint16_t ALRMVAL __attribute__((__sfr__));
#define ALCFGRPT ALCFGRPT
extern volatile uint16_t ALCFGRPT __attribute__((__sfr__));
__extension__ typedef struct tagALCFGRPTBITS {
  union {
    struct {
      uint16_t ARPT:8;
      uint16_t ALRMPTR:2;
      uint16_t AMASK:4;
      uint16_t CHIME:1;
      uint16_t ALRMEN:1;
    };
    struct {
      uint16_t ARPT0:1;
      uint16_t ARPT1:1;
      uint16_t ARPT2:1;
      uint16_t ARPT3:1;
      uint16_t ARPT4:1;
      uint16_t ARPT5:1;
      uint16_t ARPT6:1;
      uint16_t ARPT7:1;
      uint16_t ALRMPTR0:1;
      uint16_t ALRMPTR1:1;
      uint16_t AMASK0:1;
      uint16_t AMASK1:1;
      uint16_t AMASK2:1;
      uint16_t AMASK3:1;
    };
  };
} ALCFGRPTBITS;
extern volatile ALCFGRPTBITS ALCFGRPTbits __attribute__((__sfr__));

#define RTCVAL RTCVAL
extern volatile uint16_t RTCVAL __attribute__((__sfr__));
#define RCFGCAL RCFGCAL
extern volatile uint16_t RCFGCAL __attribute__((__sfr__));
__extension__ typedef struct tagRCFGCALBITS {
  union {
    struct {
      uint16_t CAL:8;
      uint16_t RTCPTR:2;
      uint16_t RTCOE:1;
      uint16_t HALFSEC:1;
      uint16_t RTCSYNC:1;
      uint16_t RTCWREN:1;
      uint16_t :1;
      uint16_t RTCEN:1;
    };
    struct {
      uint16_t CAL0:1;
      uint16_t CAL1:1;
      uint16_t CAL2:1;
      uint16_t CAL3:1;
      uint16_t CAL4:1;
      uint16_t CAL5:1;
      uint16_t CAL6:1;
      uint16_t CAL7:1;
      uint16_t RTCPTR0:1;
      uint16_t RTCPTR1:1;
    };
  };
} RCFGCALBITS;
extern volatile RCFGCALBITS RCFGCALbits __attribute__((__sfr__));

#define RTCPWC RTCPWC
extern volatile uint16_t RTCPWC __attribute__((__sfr__));
__extension__ typedef struct tagRTCPWCBITS {
  union {
    struct {
      uint16_t :8;
      uint16_t RTCOUT:2;
      uint16_t RTCLK:2;
      uint16_t PWSPRE:1;
      uint16_t PWCPRE:1;
      uint16_t PWCPOL:1;
      uint16_t PWCEN:1;
    };
    struct {
      uint16_t :8;
      uint16_t RTCOUT0:1;
      uint16_t RTCOUT1:1;
      uint16_t RTCLK0:1;
      uint16_t RTCLK1:1;
    };
  };
} RTCPWCBITS;
extern volatile RTCPWCBITS RTCPWCbits __attribute__((__sfr__));

#define MDCON MDCON
extern volatile uint16_t MDCON __attribute__((__sfr__));
typedef struct tagMDCONBITS {
  uint16_t MDBIT:1;
  uint16_t :3;
  uint16_t MDOPOL:1;
  uint16_t MDSLR:1;
  uint16_t MDOE:1;
  uint16_t :6;
  uint16_t MDSIDL:1;
  uint16_t :1;
  uint16_t MDEN:1;
} MDCONBITS;
